# Магический шар 8

# случайный выбор ответа
def gettin_answer() :
    again = 'д'
    while again.lower() == 'д' :
        need_answer = input('Твой вопрос сформулирован и ты ждешь ответа? (д = да, иной символ = нет) ')
        if need_answer.lower() == 'д' :
            print(choice(answers))
            again = input('У тебя еще остались вопросы, требующие ответа? (д = да, иной символ = нет) ')
        else :
            break

from random import *
answers = ['Бесспорно', 'Предрешено', 'Никаких сомнений', 'Определённо да', 'Можешь быть уверен в этом', 'Мне кажется - да', 'Вероятнее всего', 'Хорошие перспективы', 'Знаки говорят - да', 'Да', 'Пока неясно, попробуй снова', 'Спроси позже', 'Лучше не рассказывать', 'Сейчас нельзя предсказать', 'Сконцентрируйся и спроси опять', 'Даже не думай', 'Мой ответ - нет', 'По моим данным - нет', 'Перспективы не очень хорошие', 'Весьма сомнительно']

print('Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос.')
name = input('Как звать тебя? ')
print('Привет, ', name, '!', sep='')
gettin_answer()
print('Возвращайся, когда сформулируешь вопрос или появятся новые!')
